import {AfterViewInit, Component, ElementRef, ViewChild} from '@angular/core';
import {IntersectionObserverService} from '../../services/intersection-observer.service';

interface Item {
    title: string;
    day: number;
    month: string;
    description: string[];
}

@Component({
    selector: 'app-timeline',
    templateUrl: './timeline.component.html',
    styleUrls: ['./timeline.component.scss'],
})
export class TimelineComponent implements AfterViewInit {
    @ViewChild('section') private section!: ElementRef<HTMLElement>;

    public items: Item[] = [
        {
            title: 'آزمون ورودی دوره فرانت‌اند',
            day: 22,
            month: 'اردیبهشت',
            description: [
                `
                    این مسابقه از ساعت 15 روز 22 اردیبهشت شروع می‌شود و به مدت 5 ساعت ادامه خواهد داشت و در
                    مجموع شامل 7 سوال است که سطح آن‌ها از آسان به سخت متفاوت خواهد بود.
                `,
                `
                    برای حل سوالات باید به HTML، CSS و JavaScript مسلط باشید به طوری که 4 سوال اول مربوط به HTML
                    و CSS هستند و 3 سوال آخر مربوط به JavaScript می‌باشند.
                `,
            ],
        },
        {
            title: 'آزمون ورودی دوره مهندسی نرم‌افزار',
            day: 23,
            month: 'اردیبهشت',
            description: [
                `
                    این مسابقه از ساعت 14 روز 23 اردیبهشت شروع می‌شود و به مدت 6 ساعت ادامه خواهد داشت و در
                    مجموع شامل 5 سوال است که سطح آن‌ها از آسان به سخت متفاوت خواهد بود به طوری که 3 سوال اول
                    الگوریتمی هستند و 2 سوال آخر پیاده‌سازی می‌باشند.
                `,
                `
                    برای حل سوالات الگوریتمی می‌توانید از زبان‌های ++C و Java استفاده کنید اما سوالات پیاده‌سازی
                    را فقط می‌توانید با Java حل کنید.
                `,
            ],
        },
        {
            title: 'شروع مصاحبه',
            day: 28,
            month: 'اردیبهشت',
            description: [
                `
                    بعد از اتمام آزمون‌های ورودی، برای هماهنگی تاریخ و ساعت مصاحبه با نفرات برتر تماس گرفته می‌شود.
                `,
                `
                    از 28 اردیبهشت، مصاحبۀ هر دو دوره شروع می‌شود که هر مصاحبه از دو قسمت گروهی و انفرادی تشکیل می‌شود
                    به طوری که در قسمت گروهی، مهارت نرم متقاضیان و در قسمت انفرادی مهارت سخت آن‌ها محک زده می‌شود.
                `,
            ],
        },
        {
            title: 'اعلام نتایج نهایی',
            day: 7,
            month: 'خرداد',
            description: [
                `
                    بعد از اتمام مصاحبه، به تمام متقاضیانی که به مصاحبه دعوت شده بودند،
                    چه به عنوان کارآموز قبول شده باشند و چه نشده باشند،
                    پیام می‌دهیم و آن‌ها را از نتیجه باخبر می‌کنیم.
                `,
            ],
        },
        {
            title: 'مرحله اول کارآموزی',
            day: 18,
            month: 'تیر',
            description: [
                `
                    هدف از این مرحله، آشنایی منتورها و کارآموزها با یکدیگر است.
                    همچنین آموزش‌ها از همان روز اول در اختیار کارآموزان قرار می‌گیرد.
                `,
                `
                    برای گذراندن دوره، برنامه‌ای مدون از قبل تهیه شده است
                    و انتظار می‌رود کارآموزان همراه با آن پیش بروند.
                `,
                `
                    در هر مرحله فهرستی از کارهایی که کارآموزان باید انجام دهند به آن‌ها داده می‌شود
                    و در پایان آن مرحله، با کارآموزانی که نتوانند حداقل امتیاز را کسب کنند خداحافظی می‌کنیم.
                `,
                `
                    البته انتظار نداریم تمام کارآموزان بتوانند نمرۀ کاملی از هر مرحله کسب کنند،
                    بلکه انتظار داریم امتیاز آن‌ها از حدی بالاتر باشد که دستیابی به آن آسان است.
                `,
            ],
        },
        {
            title: 'مرحله دوم کارآموزی',
            day: 1,
            month: 'مرداد',
            description: [
                `
                    با اتمام مرحله اول، سطح علمی کارآموزها از حد مورد نظر بالاتر رفته است؛
                    بنابراین می‌توانیم آموزش‌های نیمه‌پیشرفته را شروع کنیم و آن‌ها را با چالش‌های بیشتری روبه‌رو کنیم.
                `,
                `
                    در مرحله اول، کارآموزان پروژه‌های کوچکی انجام می‌دهند تا مطالبی که یاد می‌گیرند را در عمل نیز ببینند؛
                    اما در این مرحله، سطح آموزش‌ها و همچنین سطح پروژه‌ها پیشرفته‌تر از مرحلۀ قبل است
                    و برای انجام آن‌ها نیاز به وقت و انرژی بیشتری دارند.
                `,
            ],
        },
        {
            title: 'مرحله سوم کارآموزی',
            day: 15,
            month: 'مرداد',
            description: [
                `
                    این مرحله آخرین مرحلۀ آموزش کارآموزی است که در آن سطح آموزش‌ها به بالاترین حد خود می‌رسد.
                    در این مرحله سعی می‌کنیم کارآموزها را با چالش‌های دنیای صنعت روبه‌رو کنیم و
                    پروژه‌هایی برای آن‌ها در نظر بگیریم که در دنیای واقعی نمود داشته باشند.
                `,
            ],
        },
        {
            title: 'مرحله چهارم کارآموزی',
            day: 29,
            month: 'مرداد',
            description: [
                `
                    پس از اتمام مراحل آموزشی کارآموزی، به آخرین مرحله یعنی پروژۀ پایانی می‌رسیم.
                    در این مرحله کارآموزهای فرانت‌اند و مهندسی نرم‌افزار با هم ادغام می‌شوند
                    و گروه‌های بزرگ‌تری را تشکیل می‌دهند و 3 هفته فرصت دارند تا پروژۀ خود را پیاده‌سازی کنند.
                `,
                `
                    تمام برنامه‌ریزی‌ها و تقسیم‌بندی کارها به خودِ کارآموزها سپرده می‌شود
                    و انتظار می‌رود با توجه به مهارت‌های نرمی که تا کنون یاد گرفته‌اند بتوانند این چالش را با موفقیت پشت سر بگذارند.
                    البته در طی این مدت، منتورها حضور دارند و در صورت نیاز کارآموزها می‌توانند از کمک آن‌ها استفاده کنند.
                `,
            ],
        },
        {
            title: 'پایان کارآموزی',
            day: 18,
            month: 'شهریور',
            description: [
                `
                    در انتهای دوره، کارآموزها نتیجۀ زحمات خود را در جلسه‌ای با بقیه به اشتراک می‌گذارند.
                    در این جلسه تمام افراد دخیل در کارآموزی
                    اعم از مدیران، منتورها و کارآموزهای دوره‌های فرانت‌اند و مهندسی نرم‌افزار حضور خواهند داشت.
                `,
                `
                    همچنین پس از پایان کارآموزی، از افراد برتر دعوت می‌کنیم تا در ادامۀ راه همراه ما باشند.
                `,
            ],
        },
    ];

    public constructor(private service: IntersectionObserverService) {}

    public ngAfterViewInit(): void {
        const options: IntersectionObserverInit = {rootMargin: '-120px 0px'};
        this.service.initObserver(this.section.nativeElement, 'header, li', options);
    }
}
